वृत्तिः in_repertoire आदाय अक्षरः ॱॱ अ३२ ददाति बूल आदि
    यदि अक्षरः समम् 32 आदि
        प्रत्यागमनम् सत्यम् ।
    इति
    यदि अक्षरः समम् 9 आदि
        प्रत्यागमनम् सत्यम् ।
    इति
    यदि अक्षरः समम् 10 आदि
        प्रत्यागमनम् सत्यम् ।
    इति

    ॰ Devanagari (0x0900..=0x097F)
    यदि अक्षरः न्यूनम् ०षोड्०९८० आदि
        यदि अक्षरः अधिकम् ०षोड्०८फ़्फ़् आदि
            प्रत्यागमनम् सत्यम् ।
        इति
    इति

    ॰ Devanagari Extended (0xA8E0..=0xA8FF)
    यदि अक्षरः न्यूनम् ०षोड्अ९०० आदि
        यदि अक्षरः अधिकम् ०षोड्अ८डीफ़् आदि
            प्रत्यागमनम् सत्यम् ।
        इति
    इति

    ॰ Vedic Extensions (0x1CD0..=0x1CFF)
    यदि अक्षरः न्यूनम् ०षोड्१डी०० आदि
        यदि अक्षरः अधिकम् ०षोड्१सीसीफ़् आदि
            प्रत्यागमनम् सत्यम् ।
        इति
    इति

    ॰ Devanagari Extended-A (0x11B00..=0x11B5F)
    यदि अक्षरः न्यूनम् ०षोड्११बी६० आदि
        यदि अक्षरः अधिकम् ०षोड्११अफ़्फ़् आदि
            प्रत्यागमनम् सत्यम् ।
        इति
    इति

    ॰ ZWNJ / ZWJ
    यदि अक्षरः समम् ०षोड्२००सी आदि
        प्रत्यागमनम् सत्यम् ।
    इति
    यदि अक्षरः समम् ०षोड्२००डी आदि
        प्रत्यागमनम् सत्यम् ।
    इति

    प्रत्यागमनम् असत्यम् ।
इति

वृत्तिः is_clean आदाय पाठः ॱॱ अङ्कः अन्तः अ३२ ददाति बूल आदि
    ॰ TODO: loop through slice
    प्रत्यागमनम् सत्यम् ।
इति
